espressif/esp32-camera/sensors/gc0308.c
static int set_exposure_ctrl(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    // AEC enable/disable via AAAA_EN register, AEC_ENABLE bit
    ret |= set_reg_bits(sensor->slv_addr, AAAA_EN, 0, 0x01, enable != 0);
    if (ret == 0) {
        sensor->status.aec = enable;
        ESP_LOGD(TAG, "Set AEC to: %d", enable);
    }
    return ret;
}

static int set_hmirror(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    ret |= set_reg_bits(sensor->slv_addr, CISCTL_MODE1, 0, 0x01, enable != 0);
    if (ret == 0) {
        sensor->status.hmirror = enable;
        ESP_LOGD(TAG, "Set h-mirror to: %d", enable);
    }
    return ret;
}

static int set_vflip(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    ret |= set_reg_bits(sensor->slv_addr, CISCTL_MODE1, 1, 0x01, enable != 0);
    if (ret == 0) {
        sensor->status.vflip = enable;
        ESP_LOGD(TAG, "Set v-flip to: %d", enable);
    }
    return ret;
}


static int set_agc_gain(sensor_t *sensor, int gain)
{
    int ret = 0;
    // GC0308 AGC gain range: 0-30 (standard sensor API range)
    // Maps to hardware register values 0x00-0x3F (6-bit effective range)
    // Hardware default is 0x14 (20)
    if (gain < 0) {
        gain = 0;
    } else if (gain > 30) {
        gain = 30;
    }
    // Map API range 0-30 to hardware range 0-63 (approximately 2x multiplier)
    uint8_t gain_value = (gain * 63) / 30;
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    ret |= write_reg(sensor->slv_addr, GLOBAL_GAIN, gain_value);
    if (ret == 0) {
        sensor->status.agc_gain = gain;
        ESP_LOGD(TAG, "Set AGC gain to: %d (hw: 0x%02x)", gain, gain_value);
    }
    return ret;
}


static int set_aec_value(sensor_t *sensor, int value)
{
    int ret = 0;
    // GC0308 exposure value range: 0-1200 (compatible with API)
    // Hardware range: 0-4095 (12-bit), but practical max based on frame timing
    // Default is approximately 0x01e0 (480)
    if (value < 0) {
        value = 0;
    } else if (value > 1200) {
        value = 1200;
    }
    // Exposure is 12-bit: high byte (0x03) holds bits[11:4], low byte (0x04) bits[3:0] in upper nibble
    uint8_t exp_high = (value >> 4) & 0xFF;
    uint8_t exp_low = (value << 4) & 0xF0;
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    ret |= write_reg(sensor->slv_addr, EXPOSURE_HIGH, exp_high);
    ret |= write_reg(sensor->slv_addr, EXPOSURE_LOW, exp_low);
    if (ret == 0) {
        sensor->status.aec_value = value;
        ESP_LOGD(TAG, "Set AEC value to: %d (0x%03x)", value, value);
    }
    return ret;
}

static int set_special_effect(sensor_t *sensor, int effect)
{
    int ret = 0;
    // Effect values: 0=Normal, 1=Negative, 2=Grayscale, 3=Red Tint, 4=Green Tint, 5=Blue Tint, 6=Sepia
    if (effect < 0 || effect > 6) {
        return -1;
    }
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    switch (effect) {
        case 0: // Normal
            ret |= set_reg_bits(sensor->slv_addr, SPECIAL_EFFECT, 0, 0x03, EFFECT_NORMAL);
            break;
        case 1: // Negative
            ret |= set_reg_bits(sensor->slv_addr, SPECIAL_EFFECT, 0, 0x03, EFFECT_NEGATIVE);
            break;
        case 2: // Grayscale (B&W)
            ret |= set_reg_bits(sensor->slv_addr, SPECIAL_EFFECT, 0, 0x03, EFFECT_GRAYSCALE);
            break;
        case 3: // Red Tint
        case 4: // Green Tint
        case 5: // Blue Tint
        case 6: // Sepia
            // Color tint effects: these require grayscale mode + fixed Cb/Cr values
            // However, the exact register behavior is undocumented
            // Setting to grayscale mode as a safe fallback
            ret |= set_reg_bits(sensor->slv_addr, SPECIAL_EFFECT, 0, 0x03, EFFECT_GRAYSCALE);
            ESP_LOGW(TAG, "Color tint effects (3-6) may not be fully supported - using grayscale");
            break;
        default:
            ret = -1;
            break;
    }
    if (ret == 0) {
        sensor->status.special_effect = effect;
        ESP_LOGD(TAG, "Set special effect to: %d", effect);
    }
    return ret;
}

static int set_wb_mode(sensor_t *sensor, int mode)
{
    int ret = 0;
    if (mode < 0 || mode > 4) {
        return -1;
    }
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    if (mode == 0) {
        // Auto WB - enable AWB and set auto gains
        ret |= set_reg_bits(sensor->slv_addr, AAAA_EN, 1, 0x01, 1);
        ret |= write_reg(sensor->slv_addr, AWB_R_GAIN, 0x56);
        ret |= write_reg(sensor->slv_addr, AWB_G_GAIN, 0x40);
        ret |= write_reg(sensor->slv_addr, AWB_B_GAIN, 0x4a);
    } else {
        // Manual WB - disable AWB and set specific gains
        ret |= set_reg_bits(sensor->slv_addr, AAAA_EN, 1, 0x01, 0);
        switch (mode) {
            case 1: // Sunny (Daylight)
                ret |= write_reg(sensor->slv_addr, AWB_R_GAIN, 0x74);
                ret |= write_reg(sensor->slv_addr, AWB_G_GAIN, 0x52);
                ret |= write_reg(sensor->slv_addr, AWB_B_GAIN, 0x40);
                break;
            case 2: // Cloudy
                ret |= write_reg(sensor->slv_addr, AWB_R_GAIN, 0x8c);
                ret |= write_reg(sensor->slv_addr, AWB_G_GAIN, 0x50);
                ret |= write_reg(sensor->slv_addr, AWB_B_GAIN, 0x40);
                break;
            case 3: // Office (Incandescent)
                ret |= write_reg(sensor->slv_addr, AWB_R_GAIN, 0x48);
                ret |= write_reg(sensor->slv_addr, AWB_G_GAIN, 0x40);
                ret |= write_reg(sensor->slv_addr, AWB_B_GAIN, 0x5c);
                break;
            case 4: // Home (Fluorescent)
                ret |= write_reg(sensor->slv_addr, AWB_R_GAIN, 0x40);
                ret |= write_reg(sensor->slv_addr, AWB_G_GAIN, 0x42);
                ret |= write_reg(sensor->slv_addr, AWB_B_GAIN, 0x50);
                break;
            default:
                ret = -1;
                break;
        }
    }
    if (ret == 0) {
        sensor->status.wb_mode = mode;
        ESP_LOGD(TAG, "Set WB mode to: %d", mode);
    }
    return ret;
}

